app/Models/V1/Mdl_member.php

UPDATE `member` SET `nama` = 'test', `gender` = 'male', `membership` = 'bronze', `role` = 'pegawai', `is_driver` = 'no', `update_at` = '2024-08-05 17:34:28'
WHERE `id` = '6'
---
    public function update_member($mdata, $id){
        $user   = $this->db->table("member");
        $user->where("id",$id);
        $user->update($mdata);