app/Models/V1/Mdl_promosi.php

INSERT INTO `promosi` (`deskripsi`, `tipe`, `tanggal`, `end_date`, `picture`, `created_at`) VALUES ('Promo 3', 'instore', '2024-06-22', '2024-06-30', 'promo_1719025974.jpeg', '2024-06-22 11:12:54')
---
    public function add_promo($mdata){
        $promo   = $this->db->table("promosi");
        if (!$promo->insert($mdata)){

UPDATE `promosi` SET `deskripsi` = 'Promo 2 Baru Update', `tipe` = 'instore', `tanggal` = '2024-06-22', `end_date` = '2024-06-30', `picture` = 'promo_1719047568.jpeg', `created_at` = '2024-06-22 17:12:48'
WHERE `id` = '37'
---
    public function update_promo($mdata, $id){
        $promo   = $this->db->table("promosi");
        $promo->where("id",$id);
        $promo->update($mdata);